Revit 2024 API
ComponentRepeater.DefaultFamilyType Property
 The default family type for the component repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId DefaultFamilyType { get; set; }
Visual Basic
Public Property DefaultFamilyType As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ DefaultFamilyType {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The default family type is the type of the instances in default slots. This includes slots that are added when the repeater grows. When setting this property, all slots with instances of the default type will change their components to an instance of the new default type. Empty slots will remain unchanged. Slots with non-default family instances will remain unchanged.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: Invalid type for the repeater. The type must be an adaptive family with no shape handles. In addition, it must have same category and same number of placement points as the current type of the repeater.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ComponentRepeater Class
Autodesk.Revit.DB Namespace